Question-No.1--Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
import pandas as pd
data=['4','8','15','16','23','42']
a=pd.Series(data)
print(a)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: object

Question-No.2

In [6]:
import pandas as pd
my_list = [3,4,5,7,9,2,11,45,68,22]
my_series = pd.Series(my_list)
print(my_series)

0     3
1     4
2     5
3     7
4     9
5     2
6    11
7    45
8    68
9    22
dtype: int64

Question-No.3

In [14]:
import pandas as pd
data = {'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
        'Gender':['Female','Male','Female']
       }
df=pd.DataFrame(data)

print(df)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

Question-No.4

In pandas, A DataFrame is a 2-dimensional data structure that can store data in tabular form, similar to a spreadsheet or a SQL table. It consists of rows and columns, where each column can have a different data type. Essentially, a DataFrame is a collection of pandas Series, where each Series represents a column of data.

A Series is a 1-dimensional data structure that can be seen as a labeled array. It has a single column of data with an associated label (index) for each element. You can think of a Series as a single column of a DataFrame.
Example--

In [16]:
# Example for DataFrame

import pandas as pd
data = {'Name':['Alice','Bob','Claire'],
       'Age':[25,30,27],
        'Gender':['Female','Male','Female']
       }
df=pd.DataFrame(data)

print(df)

# Example for Series

ages = pd.Series([28, 24, 22, 29], name='Age')
print("Series:")
print(ages)

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female
Series:
0    28
1    24
2    22
3    29
Name: Age, dtype: int64

Question-No.5

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions-

1-head() and tail(): These functions are used to view the first few rows (head()) or last few rows (tail()) of the DataFrame.

2-describe(): This function provides a statistical summary of the DataFrame, including count, mean, min, max, etc.

3-drop(): This function is used to remove rows or columns from the DataFrame.

4-groupby(): This function is used for grouping data based on one or more columns.

In [34]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")
df.head()
df.describe()
df.drop("PassengerId",axis=1,inplace=True)

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

Question-No.6

Series: A pandas Series is mutable, which means you can change the values in the Series after it has been created. You can modify, add, or delete elements in a Series.

DataFrame: A pandas DataFrame is also mutable. You can change the data, add or remove columns, and perform various data manipulation operations on a DataFrame.

Panel: A pandas Panel was a 3-dimensional data structure in older versions of pandas, but it has been deprecated and is not recommended for use anymore. In modern pandas versions, the Panel data structure is not available.